
#language: ru

@tree
@БыстрыеПроверкиTestIRP

Функциональность: проверка открытия Обработок

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Открытие формы объекта "AnaliseDocumentMovements"

	Дано Я открываю основную форму обработки "AnaliseDocumentMovements"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки AnaliseDocumentMovements"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "DataHistory"

	Дано Я открываю основную форму обработки "DataHistory"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки DataHistory"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "MobileDesktop"

	Дано Я открываю основную форму обработки "MobileDesktop"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки MobileDesktop"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "MobileInvent"

	Дано Я открываю основную форму обработки "MobileInvent"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки MobileInvent"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "PointOfSale"

	Дано Я открываю основную форму обработки "PointOfSale"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки PointOfSale"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "PrintLabels"

	Дано Я открываю основную форму обработки "PrintLabels"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки PrintLabels"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Procurement"

	Дано Я открываю основную форму обработки "Procurement"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Procurement"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ScanBarcode"

	Дано Я открываю основную форму обработки "ScanBarcode"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ScanBarcode"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "StoreKeeperWorkspace"

	Дано Я открываю основную форму обработки "StoreKeeperWorkspace"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки StoreKeeperWorkspace"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_ПроверкаФоновыхЗаданий"

	Дано Я открываю основную форму обработки "VAExtension_ПроверкаФоновыхЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_ПроверкаФоновыхЗаданий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_ВыполнитьПроизвольныйКод"

	Дано Я открываю основную форму обработки "VAExtension_ВыполнитьПроизвольныйКод"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_ВыполнитьПроизвольныйКод"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_ДанныеТекущегоОкна"

	Дано Я открываю основную форму обработки "VAExtension_ДанныеТекущегоОкна"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_ДанныеТекущегоОкна"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_ПолучениеМакета"

	Дано Я открываю основную форму обработки "VAExtension_ПолучениеМакета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_ПолучениеМакета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_ОткрытьВсеФункции"

	Дано Я открываю основную форму обработки "VAExtension_ОткрытьВсеФункции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_ОткрытьВсеФункции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_ОткрытьНастройкаНачальнойСтраницы"

	Дано Я открываю основную форму обработки "VAExtension_ОткрытьНастройкаНачальнойСтраницы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_ОткрытьНастройкаНачальнойСтраницы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_НажатьГиперссылкуHTMLДокумента"

	Дано Я открываю основную форму обработки "VAExtension_НажатьГиперссылкуHTMLДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_НажатьГиперссылкуHTMLДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_НажатьКнопкуHTMLДокумента"

	Дано Я открываю основную форму обработки "VAExtension_НажатьКнопкуHTMLДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_НажатьКнопкуHTMLДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_ОткрытьВнешнююОбработкуИлиОтчет"

	Дано Я открываю основную форму обработки "VAExtension_ОткрытьВнешнююОбработкуИлиОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_ОткрытьВнешнююОбработкуИлиОтчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_ВнешниеСобытия"

	Дано Я открываю основную форму обработки "VAExtension_ВнешниеСобытия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_ВнешниеСобытия"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_ПроведениеДокумента"

	Дано Я открываю основную форму обработки "VAExtension_ПроведениеДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_ПроведениеДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "VAExtension_МакетПоВариантуОтчета"

	Дано Я открываю основную форму обработки "VAExtension_МакетПоВариантуОтчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки VAExtension_МакетПоВариантуОтчета"
	И Я закрываю текущее окно


