#language: ru

@tree
@БыстрыеПроверкиДемобаза


Функциональность: проверка открытия регистров сведений

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "КурсыВалют" 

	Дано Я открываю основную форму списка регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КурсыВалют"

	Дано Я открываю основную форму регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦеныТоваров" 

	Дано Я открываю основную форму списка регистра сведений "ЦеныТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦеныТоваров"

	Дано Я открываю основную форму регистра сведений "ЦеныТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЦеныТоваров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеВходящихПисем" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеВходящихПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеВходящихПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеВходящихПисем"

	Дано Я открываю основную форму регистра сведений "СостояниеВходящихПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеВходящихПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостояниеИсходящихПисем" 

	Дано Я открываю основную форму списка регистра сведений "СостояниеИсходящихПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеИсходящихПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостояниеИсходящихПисем"

	Дано Я открываю основную форму регистра сведений "СостояниеИсходящихПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостояниеИсходящихПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Характеристики" 

	Дано Я открываю основную форму списка регистра сведений "Характеристики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Характеристики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Характеристики"

	Дано Я открываю основную форму регистра сведений "Характеристики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Характеристики"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МобильныеОтчеты" 

	Дано Я открываю основную форму списка регистра сведений "МобильныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МобильныеОтчеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МобильныеОтчеты"

	Дано Я открываю основную форму регистра сведений "МобильныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений МобильныеОтчеты"
	И Я закрываю текущее окно

